Repository: 84000/data-translation-memory
Catalog: toh558-v1.tmx
Source language: bo
Languages: en

source: སྤུ་གྲིའི་སོ་ནི་རྩུབ་པོ་ཡིས། །དེ་ཡི་ལྕེ་ནི་གཅོད་པར་འགྱུར། །
en: Cut out his tongue With a jagged knife,

source: མཚོན་ཆ་ཤིན་ཏུ་རྣོན་པོ་ཡིས། །དེ་ཡི་སྣ་དང་རྣ་བ་གཅོད།
en: Cut off his ears and nose With a sharp knife,

source: འཁོར་ལོ་སྤུ་གྲིའི་སོ་འདྲ་བས། །ཀླད་པ་རབ་ཏུ་གཤེགས་པར་བྱེད། །
en: Cut out his brains With a circular saw,

source: ཐོ་བ་ལྕགས་ཀྱིས་དཀྲིས་པ་ཡིས། །དེ་ཡི་སྙིང་ལ་འཇོམས་པར་བྱེད། །
en: And pulverize his heart With a sledgehammer.

source: རྣག་དང་ཁྲག་ནི་དྲོན་མོ་དག །དེ་ཡི་ཁ་ནས་འཛག་པར་འགྱུར། །
en: Warm pus and blood Will flow from his mouth.

source: རིག་སྔགས་ཞགས་པའི་ཆད་པ་ཡིས། །རྟག་ཏུ་འཁོར་བར་འགྲོ་བ་ན། །
en: “Through the punishment of the noose incantation, They will perpetually wander in saṃsāra.

source: འཁོར་བ་གནོད་སྦྱིན་དཀྱིལ་འཁོར་དུ། །དེ་ཉིད་དུ་ནི་འཁོར་བར་འགྱུར། །
en: They will keep on cycling just there, In the cyclic existence of the yakṣa world.”

source: རྒྱལ་པོ་ཆེན་པོ་དཔལ་ལྡན་པ། །ཕྱོགས་བཞི་དག་ཏུ་སོང་གྱུར་ནས། །
en: Each of the glorious great kings Then went to one of the four directions.

source: ཆོས་ཀྱི་གོ་ཆ་བགོས་གྱུར་ཏེ། །བཟང་པོའི་ཁྲི་ལ་འདུག་པ་ནི།
en: Clad in the armor of Dharma, They sat on fine thrones.

source: ཤར་ཕྱོགས་ན་ནི་ཡུལ་འཁོར་སྲུང་། །ལྷོ་ཕྱོགས་ན་ནི་འཕགས་སྐྱེས་པོ། །ནུབ་ཕྱོགས་ན་ནི་མིག་མི་བཟང་། །བྱང་ཕྱོགས་ན་ནི་ལུས་ངན་པོ། །
en: Dhṛtarāṣṭra was in the east, Virūḍhaka in the south, Virūpākṣa in the west, And Kubera in the north.

source: དཔལ་དང་གཟི་བརྗིད་འབར་བ་ཡི། །རྒྱལ་པོ་དག་ནི་ཕྱིན་པ་དང་། །དེ་ཚེ་སྟོན་པ་ཐམས་ཅད་མཁྱེན། །བར་སྣང་གནས་ལ་རབ་ཏུ་འཕགས། །
en: When the great kings, Radiant with glory and splendor, had thus departed, The omniscient teacher Floated up, suspended in space.

source: ཚངས་པས་སྤྲུལ་པའི་གཞལ་མེད་ཁང་། །དེར་ནི་རྡོ་རྗེའི་གདན་ལ་བཞུགས། །
en: There, on a vajra seat, In a mansion emanated by Brahmā, he took his seat.

source: དེ་ནས་ཚངས་དང་ཚངས་ཆེན་རྣམས། །ཐལ་མོ་སྦྱར་འཁོད་ཕྱག་འཚལ་ལོ། །
en: Then, Brahmā, Great Brahmā, Standing with palms joined, paid homage:

source: དཔལ་ལྡན་གསེར་གྱི་རི་བོ་འདྲ། །གསེར་གྱི་མཆོད་སྡོང་དང་ཡང་མཚུངས། །
en: “Glorious One, you are like a golden mountain, Or a golden sacrificial post.

source: མེ་ཏོག་པདྨ་བཞིན་དུ་རྒྱས། །སཱ་ལའི་རྒྱལ་པོ་བཞིན་དུ་རྒྱས། །
en: You are like a lotus flower in full bloom, Or the king of sal trees in blossom.

source: འཇིག་རྟེན་མེས་པོ་ཚངས་པ་ཡིས། །འཇིག་རྟེན་སྒྲོན་མ་བསྟོད་བྱས་ཏེ།
en: Brahmā, Forefather of the World, Had thus praised the Light of the World,

source: འཇིག་རྟེན་མགོན་པོའི་སྤྱན་སྔར་
en: In front of the Lord of the World,

source: ཉི་མ་དང་འདྲ་ཟླ་ཉ་ལ། །སྐར་མ་རྣམས་ཀྱིས་ཡོངས་བསྐོར་བཞིན། །
en: “Like the sun, or the full moon, Surrounded by stars,

source: འཇིག་རྟེན་སྐྱོང་ལ་འདི་སྐད་སྨྲས། །
en: addressed the guardians of the world:

source: ཐུབ་སྐུ་གསེར་གྱི་ཁ་དོག་ལ། །མཚན་རྣམས་ཀྱིས་ནི་ཡོངས་སུ་བསྐོར།
en: The Sage, with his golden complexion, Is replete with sublime characteristics.”

source: འཇིག་རྟེན་སྐྱོང་གི་འཁོར་རྣམས་ཀྱིས། །རྗེས་སུ་བསྟན་པ་མ་ཐོབ་སྟེ། །
en: “The entourages of the guardians of the world Have not received the instruction,

source: འཇིག་རྟེན་སྐྱོང་གི་འཁོར་རྣམས་ཀྱིས། །རྗེས་སུ་བསྟན་པ་མ་ཐོབ་
en: “The entourages of the guardians of the world

source: གང་ཕྱིར་འདི་ལས་སངས་རྒྱས་དང་། །རང་སངས་རྒྱས་དག་འབྱུང་འགྱུར་
en: Because from it emerge buddhas And pratyekabuddhas.

source: འདི་ལས་ཉན་ཐོས་རྣམས་ཀྱང་སྐྱེ། །
en: “Śrāvakas are born from it,

source: ལྷ་རྣམས་དག་ཀྱང་སྐྱེ་བར་འགྱུར། །
en: And gods, too, are born from it.

source: རིག་བྱེད་ཡན་ལག་དྲུག་མཐར་ཕྱིན། །བྲམ་ཟེ་རྣམས་ཀྱང་སྐྱེ་བར་འགྱུར།
en: Brāhmans, who have mastered the six branches of Vedic learning, Are also born from it.

source: དྲང་སྲོང་སྐལ་བ་ཆེན་པོ་དང་། །དགེ་སྦྱོང་བྲམ་ཟེ་
en: distinguished sages And mendicant brāhmins.

source: མི་ཡི་སྐྱེ་དགུ་གནོད་པར་འགྱུར། །
en: Humanity is being tormented

source: ཁྱེད་ཅག་སྙིང་ལས་ཆུང་བྱེད་པ། །
en: From your lack of concern.”

source: ཚངས་པ་ཡི་ནི་ཚིག་ཐོས་ནས། །འཇིག་རྟེན་སྐྱོང་གིས་ཚིག་སྨྲས་པ། །
en: When they heard Brahmā’s speech, The guardians of the world said:

source: ཚངས་པ་ཆེན་པོ་དེ་བཞིན་ནོ། །
en: “It is so, Great Brahmā!

source: ཐུབ་པ་ཆེན་པོ་དེ་བཞིན་ནོ། །
en: It is so, Great Sage!

source: བདག་གིས་རི་རབ་བསྒུལ་བྱས་ཤིང་། །ས་ཡང་རབ་ཏུ་བཟློག་བྱས་ལ། །རྒྱ་མཚོ་ལ་ནི་ཐུག་པ་རྣམས། །རྣམ་པར་སྦྱང་བ་ཉིད་དུ་བྱ། །
en: “We will purify all this, As far as the ocean, Shaking Mount Sumeru And overturning the earth!

source: ཞགས་པ་དམ་པོ་མ་ཉམས་པས། །
en: “With lasso, tight and sturdy,

source: ཉི་མ་ཟླ་བ་རླུང་རྣམས་དང་། །སྐར་མ་དག་ནི་ཐམས་ཅད་ཀྱང་། །བདག་གིས་སུ་ནི་བཅིང་བར་བྱ། །
en: We will bind The sun, the moon, the winds, And all the stars!

source: གང་དག་རབ་ཏུ་སྡང་བྱེད་ཅིང་། །འཇིག་རྟེན་ལ་ནི་ཕན་མི་བྱེད། །དེ་དག་ལ་ནི་ཐམས་ཅད་དུ། །ཕྱོགས་ཀྱང་སྣང་བར་མི་བྱའོ། །
en: “We will forever eliminate Even the quarters of those Who are wicked And do the world no good.

source: འཇིག་རྟེན་ལྷ་དང་བཅས་པ་དེ། །འབྱུང་པོ་རྣམས་ཀྱི་ཕྱིར་སྨོད་དེ། །
en: “This world with its gods Complains on account of the bhūtas.

source: འབྱུང་པོ་མི་ཡི་སྐྱེ་དགུ་ལ། །གནོད་པར་བྱེད་ཅིང་འཚེ་བར་བྱེད། །
en: The bhūtas harm human beings And endanger them.

source: གང་དག་སྔགས་དང་སྨན་རྣམས་དང་། །རིག་སྔགས་ལས་ནི་འདའ་བྱེད་པ། །འདི་ལ་སྔགས་ཀྱི་དམ་པ་ནི། །ཕ་རོལ་གནོན་པ་སྟོན་པར་བྱེད། །
en: “The mantra holders show That anyone who transgresses Mantras, medicines, or incantations Is defeated.

source: ཀུན་ཏུ་ཆད་པས་བསྡིགས་བྱས་ཏེ། །
en: “Having threatened them thoroughly with punishment

source: ཡང་དག་པར་ཡང་བརྗོད་པར་བགྱི། །
en: We will now speak

source: འཇིག་རྟེན་མགོན་པོའི་སྤྱན་སྔར་ནི། །
en: Before the Lord of the World

source: རིག་སྔགས་ལས་ནི་འདའ་བའི་འཁོར། །
en: To our retinues that transgress the incantation.

source: དེ་དག་ཆད་པ་བཤད་པར་བྱ། །
en: “We will now mete out the punishment—

source: ཚངས་པས་སྤྲུལ་པའི་མདོ་སྡེའོ། །
en: The sūtra manifested by Brahmā—

source: གང་གིས་འབྱུང་པོའི་དཀྱིལ་འཁོར་དུ། །འདི་བཤད་པ་ན་མི་ཉན་པ། །
en: To those in the circle of bhūtas Who did not obey when it was uttered.”

source: སངས་རྒྱས་ཞབས་ལ་ཕྱག་འཚལ་ཏེ། །ཕན་ཚུན་དུ་ནི་བལྟ་བྱས་ན། །
en: They bowed to the feet of the Buddha And glanced at one another.

source: རྩིབས་སྟོང་ཁ་དོག་གསེར་འདྲ་བའི། །ཤིང་རྟ་རྣམ་པ་བཞི་བྱས་པ། །བཟོ་རྣམས་ཀུན་དང་ལྡན་པ་
en: on four golden chariots, Fit for all tasks, With wheels with a thousand spokes,

source: རིན་ཆེན་བདུན་གྱིས་བརྒྱན་པ་ཡི། །
en: studded with the seven types of precious substances—

source: བཻ་ཌཱུརྱ་དང་གསེར་དང་དངུལ། །མུ་ཏིག་རྣམས་དང་ཤེལ་དག་དང་། །སྤུག་དང་རྡོ་ཡི་སྙིང་པོ་དང་། །
en: Beryl, gold, and silver, Pearl and crystal, Ruby and emerald—

source: རྫུ་འཕྲུལ་གྱིས་ནི་མཁའ་ལ་འགྲོ། །
en: miraculously took to the sky.

source: རྒྱལ་པོ་དག་ནི་དེར་བཞུགས་ནས། །འབྱུང་པོའི་དཀྱིལ་འཁོར་ཉིད་དུ་དོང་།
en: The kings, seated there, Arrived within the circle of bhūtas.

source: གནོད་སྦྱིན་གྱི་ནི་སྡེ་དཔོན་ཀུན། །ཕྱོགས་བཞི་དག་ཏུ་དགྱེ་བ་བྱས། །
en: They dispatched all the yakṣa generals To the four directions, saying:

source: ས་ནི་གསེར་གྱི་ཕྱེ་མ་དང་། །མེ་ཏོག་དག་གིས་བཀང་བྱས་ནས།
en: “Strew the ground With gold dust and flowers.

source: མགུལ་པར་ལྟུང་དང་སྐུད་པ་དང་། །ཞགས་པ་དག་ཀྱང་གདགས་བྱོས་ལ། །ཕྱོགས་ཀྱི་ས་ནི་ཅི་སྙེད་པའི། །འབྱུང་པོ་ཐམས་ཅད་ཁྲིད་ཤོག་ཅེས། །
en: “Then, fasten sticks, cords, and nooses To the necks of all the bhūtas Present throughout the lands And bring them here!

source: སྟོང་ཆེན་རབ་ཏུ་འཇོམས་པ་ཡི། །མདོ་སྡེ་ཡི་ནི་དམ་པ་འདི། །
en: “The sublime sūtra Destroyer of the Great Trichiliocosm

source: ཚངས་པའི་འཇིག་རྟེན་བར་དུ་བྱུང་། །
en: Heard as far as the Brahma worlds,

source: ལྷ་རྣམས་ཀུན་གྱིས་རྣམ་པར་བསམས། །
en: Is pondered by all gods.

source: སྟོང་ཆེན་པོ་ཡི་ལུས་ཀྱིས་སུ། །གནོད་སྦྱིན་དང་ནི་སྲིན་པོ་བཏུལ། །
en: “Yakṣas and rākṣasas are vanquished By the body of The Great Trichiliocosm

source: ལུས་ངན་པོ་ཡི་ཚིག་ཐོས་ནས། །གནོད་སྦྱིན་གྱི་ནི་སྡེ་དཔོན་དག །ཕྱོགས་བཞི་དག་ཏུ་སོང་
en: When the yakṣa generals Heard Kubera’s words, They went throughout the four directions.

source: གསང་བ་པོ་ལ་དྲག་ཏུ་བསྒོ།
en: They called out loudly to the guhyakas:

source: ཐུབ་པ
en: “O Sage!

source: ཤར་ཕྱོགས་ཆ་ན་འཁོད་པ་དག །
en: assemblies of bhūtas in the east,

source: འབྱུང་པོ་ཉི་ཤུ་བརྒྱད། །
en: Twenty-eight bhūtas,

source: དྲི་ཟ་ལས་བྱུང་གདོན་གྱི་རྣམས། །
en: Grahas born from gandharvas,

source: ང་ལ་ཉོན།
en: Obey me!

source: མདོ་སྡེའི་ཞགས་པས་དེ་དག་ཀུན། །བཅིང་བ་ལྔ་ཡིས་བསྡམས་པ་ཡི། །
en: By means of the sūtra noose They are all bound by the five fetters!

source: ལྷོ་ཕྱོགས་ཆ་འདིར་འཁོད་པ་དག །
en: assemblies of bhūtas in the south,

source: གྲུལ་བུམ་ལས་བྱུང་གདོན་གྱི་རིགས། །
en: Grahas born from kumbhāṇḍas,

source: ནུབ་ཕྱོགས་ཆ་འདིར་འཁོད་པ་
en: assemblies of bhūtas in the west,

source: ཀླུ་ལས་གདོན་དུ་གྱུར་པ་རྣམས། །
en: Grahas born from nāgas,

source: བྱང་ཕྱོགས་ཆ་འདིར་འཁོད་པ་དག །
en: assemblies of bhūtas in the north,

source: གནོད་སྦྱིན་ལས་ནི་གདོན་གྱུར་པ། །
en: Grahas born from yakṣas,

source: གནོད་སྦྱིན་བྱེ་བ་དྲུག་ཅུ་དག །
en: “The six hundred million yakṣas

source: གནོད་སྦྱིན་བྱེ་བ་དྲུག་ཅུ་རྣམས། །
en: “The six hundred million yakṣas

source: ཀུན་ཏུ་རྒྱལ་བ་མི་ལ་ཞོན། །དེ་ཡི་དྲུང་ན་
en: In the court of Sañjaya, He Who Is Born by Men,

source: ལུས་ངན་པོ་ཡི་བུ་ཐུ་བོ། །
en: The oldest son of Kubera,

source: བཅིང་བ་རྣམ་པ་ལྔས་བསྡམས་ནས། །
en: Are bound by the five fetters,

source: མདོ་སྡེའི་ཞགས་པས་ཀུན་ཏུ་དྲངས། །
en: brought forth with the sūtra noose.

source: དེ་ཉིད་ཀྱི་ནི་བུ་གཉིས་པ། །སྐྱེད་པ་པོ་ཞེས་རྣམ་གྲགས་པ། །དེ་ཡི་དྲུང་ན་འཁོད་པ་ཡི། །
en: In the court Of Kubera’s second oldest son, Known as Janaka,

source: དེ་ཉིད་ཀྱི་ནི་བུ་གསུམ་པ། །དེ་ཡི་མིང་ནི་གདོན་པོ་ཆེ། །དེ་ཡི་དྲུང་ན་འཁོད་པ་ཡི། །
en: In the court Of Kubera’s third oldest son, Whose name is Mahāgraha,

source: དེ་ཉིད་ཀྱི་ནི་བུ་བཞི་པ། །དེ་ཡི་མིང་ནི་བུམ་པའི་ལྟོ། །དེ་ཡི་དྲུང་ན་འཁོད་པ་ཡི།
en: In the court Of Kubera’s fourth oldest son, Whose name is Kalaśodara,

source: དབང་ཕྱུག་ཆེན་པོ་ལྷ་ཆེན་པོ། །ལག་བཞི་པ་ལ་སྟོབས་པོ་ཆེ། །དེ་ཡི་དྲུང་ན་འཁོད་པ་ཡི། །
en: In the court of the great god Maheśvara, The Four-Armed One, Mahābala,

source: འབྱུང་པོ་འཇོམས་པའི་རི་ལ་ནི། །འབྱུང་པོ་ཐམས་ཅད་ལྷགས་ནས་སུ། །
en: “Once all the bhūtas have arrived On the mountain that destroys bhūtas,

source: རིག་སྔགས་ཐམས་ཅད་འབྱུང་བའི་གནས། །རིག་སྔགས་འདི་ནི་ཀུན་ཏུ་བསམས། །
en: They ponder this incantation, The source of all incantations.

source: ཆད་པ་མི་བཟད་དྲག་པོ་སྟེ། །གང་ཕྱིར་སངས་རྒྱས་ཀུན་གྱིས་གསུངས། །
en: “Since this severely strict punishment Was uttered by all buddhas,

source: གཽ་ཏ་མ་ལ་གུས་པར་ནི། །ཐམས་ཅད་དེ་ལ་སྐྱབས་སུ་སོང་། །
en: We all respectfully Go to Gautama for refuge!

source: གཡོ་མེད་པར་ནི་རྗེས་ཞུགས་ཤིག །
en: “You should firmly obey this,

source: ཐམས་ཅད་མེད་པར་གྱུར་ཏ་རེ།
en: And everything will vanish!”

source: དེ་ནས་ཐང་ཅིག་ཡུད་ཙམ་གྱིས། །
en: Then, all of a sudden

source: འབྱུང་པོ་མང་པོ་ཐམས་ཅད་ལྷགས། །
en: The assemblies of bhūtas arrived.

source: གནོད་སྦྱིན་བྱེ་བ་སྟོང་རྣམས་ནི། །རིག་སྔགས་ཞགས་པས་བཀུག་པ་རྣམས། །
en: Through the noose incantation Billions of yakṣas were summoned—

source: རི་རྣམས་དང་ནི་གཡང་ས་དང་། །རྒྱ་མཚོ་དང་ནི་མཚོ་རྣམས་དང་། །ཀླུང་དང་འབབ་ཆུ་ལུ་མ་དང་། །
en: Those that dwell On mountains and precipices, In oceans and lakes, In rivers, cascades, and springs;

source: དབའ་ཀློང་དག་ན་གང་འཁོད་དང་། །སྐྱེད་མོས་ཚལ་དང་གཞལ་མེད་ཁང་། །ཀུན་དགའ་དང་ནི་ནགས་རྣམས་དང་། །མཆོད་རྟེན་གནས་དང་གྲོང་གི་གནས། །ལྗོན་ཤིང་དྲུང་ན་གང་གནས་དང་། །
en: Those that dwell in parks and mansions, In gardens and forests, In shrines and towns, And at tree trunks;

source: གྲོང་ཁྱེར་སྒོ་དང་གྲོང་དང་ནི། །གྲོང་རྡལ་དང་ནི་ལྗོངས་རྣམས་དང་། །རྒྱལ་པོའི་ཕོ་བྲང་སྒོ་རྣམས་དང་། །གཞལ་མེད་ཁང་ན་གང་གནས་དང་། །
en: Those that dwell at town gates and in villages, In cities and countries, In royal palaces and doorways, And in mansions;

source: དཀྱིལ་འཁོར་དག་དང་དུར་ཁྲོད་དང་། །དེ་བཞིན་ལྷ་ཁང་རྣམས་དང་ནི། །མཚམས་དང་ཤོ་གམ་གནས་རྣམས་དང་། །ཁང་སྟོང་དང་ནི་གྲམ་ས་དང་། །
en: Those that dwell in maṇḍalas and charnel grounds, And likewise, in temples, At borders, and in customs houses, Empty houses, and wild places;

source: གནོད་སྦྱིན་གང་རྣམས་བླ་འོག་དང་། །
en: All the yakṣas were summoned from above and below,

source: ཕྱོགས་བཞི་དང་ནི་མཚམས་རྣམས་
en: The four directions, and all intermediate directions.

source: རྫ་རྔ་དག་ནི་བརྡུངས་ནས་སུ། །
en: Some played clay drums,

source: ལ་ལས་རྔ་ཟླུམ་དག་ནི་བརྡུངས། །
en: Others played gargara drums.

source: པི་ཝང་གླིང་བུ་འཁར་བའི་རྔ། །སྟོབས་ཆེན་རྣམས་ནི་སྒྲ་འབྱིན་
en: The Mahābalas played Lutes, flutes, and small kettledrums.

source: རོལ་མོའི་དབྱངས་སྒྲ་སྣ་ཚོགས་དང་། །གླུ་དང་གར་རྣམས་བྱས་ནས་སུ། །
en: As they played these instruments, Sang songs, and danced,

source: དབང་པོ་ཟླ་བ་ཆུ་ལྷ་དང་། །
en: Indra, Soma, and Varuṇa,

source: བྷ་ར་དྭ་ཛ་སྐྱེ་དགུའི་བདག
en: Bharadvāja and Prajāpati,

source: མི་ལྡན་པ་དང་ཀུན་ཏུ་ལྟ། །
en: Vikala and Lohitākṣa,

source: མངོན་ཤེས་གངས་ཅན་རྫོགས་པ་དང་། །
en: Himavat and Supūrṇaka,

source: ཙནྡན་དང་ནི་འདོད་མཆོག་དང་། །
en: Candana and Kāmaśreṣṭhī,

source: མགུལ་པ་མཛེས་དང་མགུལ་ངེས་དང་། །
en: Maṇikaṇṭha and Nikaṇṭhaka,

source: སྐྱེ་དགུའི་བླ་མར་གྱུར་པ་དང་། །ལྷ་ལས་བྱུང་བའི་མ་ལྡན་དང་། །
en: Prajāguru, The divine son Mātali,

source: དྲི་ཟ་སྣ་ཚོགས་སྡེ་དང་ནི། །མི་རྒྱལ་རྒྱལ་བ་ཁྱུ་མཆོག་དང་། །དེ་བཞིན་ཕུད་པུ་ལྔ་ཞེས་བྱ། །
en: The gandharva Citrasena, Nararāj, Jinarṣabha, Likewise the one named Pañcaśikha,

source: གཡེར་མ་དང་ནི་ཉི་ཟེར་དང་། །ཉ་ལྕིབས་དང་ནི་རལ་གྲི་བུ། །ཀུན་གྱི་བཤེས་དང་གྲགས་འཛིན་དང་། །འབྲོག་གནས་དང་ནི་ཡིད་བཟངས་དང་། །ཁབ་སྣ་དང་ནི་རི་སུལ་ཁ། །ལྔ་འཛིན་དང་ནི་ཁབ་བཟངས་དག
en: Tumburu and Sūryavarcasa, Śaila and Asiputra, Viśvāmitra and Yaśodharā, Āḍavaka and Sumanas, Śūcīkarṇa and Darīmukha, Pañcālagaṇḍa and Sumukha,

source: སྡེ་དང་དཔུང་དང་བཞོན་པར་བཅས། །
en: All with their sentinels, troops, and mounts,

source: ལྷ་དང་ཀླུ་དང་དྲི་ཟ་དང་། །
en: gods, nāgas, and gandharvas,

source: གནོད་སྦྱིན་སྲིན་པོ་ལྷ་མ་ཡིན། །
en: Yakṣas, rākṣasas, and asuras,

source: ཉིན་གསུམ་པ་ཡི་སྨྱོ་བྱེད་དང་། །དེ་བཞིན་བཞི་པའི་རིམས་དག་དང་། །
en: The unmādas that return every third day, Fevers that recur every fourth day,

source: འཇིག་རྟེན་འཚེ་བ་གང་ཡིན་པ། །གནོད་སྦྱིན་སྲིན་པོ་མ་རུངས་རྣམས། །
en: And all the wicked yakṣas and rākṣasas, Harmful to the world,

source: ཕྱོགས་བཞི་ནས་ནི་བཀུག་ནས་སུ། །
en: Present throughout the four directions.

source: བཅིང་བ་ལྔ་ཡིས་བསྡམས་པ་རྣམས། །འཇིག་རྟེན་མགོན་པོའི་སྤྱན་སྔ་རུ། །ཐལ་སྦྱར་འཁོད་ནས་འདི་སྐད་སྨྲས། །
en: Bound by the five fetters, They stood with palms joined And addressed the Lord of the World:

source: ཕྱག་འཚལ་སྐྱེས་བུ་དཔའ་ཁྱོད་ལ། །ཕྱག་འཚལ་སྐྱེས་བུ་མཆོག་ཁྱོད་ལ།
en: “Homage to you, heroic being! Homage to you, supreme being!

source: ཐལ་མོ་སྦྱར་ནས་ཕྱག་འཚལ་ལོ། །ཆོས་རྒྱལ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: We pay homage to you with palms joined! Homage to you, king of Dharma!

source: དེ་དག་གི་ནི་མདུན་རྒྱུག་པ། །འབྱུང་པོ་གནོད་སྦྱིན་ལུས་པོ་ཆེ།
en: “Running before them Are bhūta yakṣas with large bodies,

source: ལག་པ་བཞི་པ་མ་རུངས་པ། །རྐང་མངས་དང་ནི་རྐང་གཅིག་པ། །
en: Terrible ones with four arms, With many feet, or one foot,

source: རྐང་བཞི་པ་དང་རྐང་གཉིས་པ། །རྐང་པ་བསྒྲེང་ལ་སྤྱིའུ་ཚུགས་དང་། །
en: With four feet, or two feet, With feet above and face below,

source: ལུས་མང་མགོ་བོ་གཅིག་པ་དང་། །ལུས་གཅིག་པ་ལ་མགོ་བཞི་པ། །
en: “With many bodies and one head, With one body and four heads,

source: མིག་མངས་པོ་ལ་ལུས་ཕྱེད་དང་། །མིག་གཅིག་ལྟོ་ནི་བཅུ་གཉིས་དང་། །
en: With many eyes and half a body, With one eye and twelve stomachs,

source: བོང་བུ་རྔ་མོ་གླང་ཆེན་མགོ། །ལག་པ་བསྒྲེང་ལ་མགོ་བཏུད་དང་། །མཚོན་ཆའི་སོ་དང་མཚོན་ཆའི་ལག །མཚོན་ཆའི་རྐང་པ་
en: “With the heads of ass, camel, and elephant, With arms above and head hanging, With weapons for teeth, arms, and feet,

source: སྲིན་པོའི་རྣམས། །ཟངས་ཀྱི་སྐྲ་དང་ཟངས་ཀྱི་སོ། །ཟངས་ཀྱི་མིག་དང་ཟངས་ཀྱི་ལག །ཟངས་ཀྱི་ཐོ་བའི་རྐང་པ་དང་། །ཟངས་ཀྱི་སྣ་དང་ཟངས་ཀྱི་ཁ། །
en: “Rākṣasas with copper hair and teeth, Copper eyes and arms, Copper hammers for feet, Copper noses and mouths,

source: རྐང་ལག་ཀུན་ཏུ་འབར་བ་དང་། །
en: With hands and feet ablaze,

source: མི་ཡི་ལུས་སུ་གནས་པ་རྣམས། །སྒུར་ཞར་ལྦ་བ་གསུམ་ཡོད་པ། །མིག་མི་སྡུག་ལ་ཁ་གླལ་བ། །
en: “Ones that dwell inside the bodies of humans, Hunchbacked, one eyed, and with boils, With disfigured eyes and yawning mouths,

source: ཆུ་སྲིན་སྟག་གི་གཟུགས་དང་ནི། །གཟུགས་མི་སྡུག་དང་ཁ་རལ་པོ། །མཆུ་འཕྱངས་པོ་དང་སོ་ཡོན་པོ། །རབ་ཏུ་གཏུམ་པོ་ཁྲོ་གཉེར་ཅན། །
en: With bodies of sea monsters and tigers, Monstrous, with gaping mouths, Dangling lips, and curled fangs, Wicked faces, wrinkled with wrath,

source: གསུས་པོ་ཆེ་དང་བུམ་རྣ་བོ། །རྣ་འཕྱངས་པ་དང་རྣ་བ་མེད། །ལག་རིང་དང་ནི་རྣ་བ་རིང་། །སྣ་ཡི་རྩེ་དང་ལག་རྩེ་རིང་། །
en: “With swollen bellies and vase-shaped ears, With hanging ears, or no ears, With long arms and long ears, Long noses and long hands,

source: ལུས་སྐམ་ལུས་ནི་རིད་པ་དང་། །སྐྲ་རིང་རབ་ཏུ་བརྒྱན་པ་དང་། །རྐང་པ་མིད་པ་ཕྲ་བ་དང་། །
en: “With wizened bodies, long bodies, And long hair, well adorned, With thin feet and necks,

source: དྲི་ང་བ་དང་བུམ་ལྟོ་བོ། །
en: Malodorous, and with gourd-shaped bellies,

source: ཡན་ལག་ཆུ་སྲིན་འདྲ་བ་དང་། །གཏུན་ཤིང་ཐོ་བ་འདྲ་བའི་ལྟོ། །གནམ་ལྟོ་བོ་ལ་རྣ་བོ་ཆེ། །གྱེན་དུ་བརྫེས་སྐྲ་རབ་ཏུ་དམར། །
en: “With limbs like a sea monster’s, Bellies like wooden pestles and hammers, Eyes cocked up, big noses, And bright red hair sticking straight up,

source: མགོ་བོ་ཆེ་ལ་གཞུ་མགྲིན་པོ། །སྐེམ་པོ་སྒུར་པོ་བུམ་ལྟོ་བོ། །
en: “With big heads, necks like bows, Wizened, hunchbacked, and with gourd-shaped bellies—

source: རི་རབ་རྩེ་མོ་བསྒུལ་ནས་སུ། །མེ་མདག་གི་ནི་ཆར་པ་འབེབས། །
en: “They poured down a rain of flaming sparks, Shaking the peak of Mount Sumeru.

source: ལྗོན་ཤིང་རི་དང་རྡོ་བ་དང་། །སྤྲིན་གྱི་ཚོགས་ཀྱི་མདོག་འདྲ་བ། །དུང་དང་རྔ་ཆེན་རྫ་རྔ་དང་། །གྲུལ་བུམ་རྔ་ཕྲན་རྣམས་ཀྱི་སྒྲ། །འཇིགས་པའི་སྒྲ་ནི་རབ་ཏུ་འབྱིན། །
en: “With complexions like trees, mountains, stones, Or cloud masses, The kumbhāṇḍas let out the horrific sounds Of percussion music With conch shells, kettledrums, clay drums, and large kettledrums.

source: མིད་པོ་ཆེ་ལ་བོང་བུའི་སྒྲ། །ནག་པོ་སེར་པོ་སྔོན་པོ་དང་། །དམར་སེར་མེ་ལྟར་དམར་སེར་དང་། །ཁབ་འདྲའི་སྤུ་དང་རལ་གྲིའི་སྒྲ། །
en: “With large throats, they brayed like donkeys. They were black, yellow, and blue, Or orange, as orange as fire, With body hairs like needles and head hairs like swords.

source: དམར་པོ་ཁྲག་གིས་བསྐུས་པ་རྣམས། །མི་རོ་དག་ནི་ཁྱེར་ནས་སུ། །ཟ་བཞིན་དུ་ནི་རྣམ་པར་རྒྱུག །
en: “Smeared red with blood, They ran around, Seizing and devouring Human corpses.

source: སོ་རྣོན་ལག་པ་དམར་པོ་དང་། །མཆུ་ནི་ཁྲག་གིས་བསྐུས་པ་དང་། །ལུས་ཕྱེད་དག་ནི་ཟོས་པ་དང་། །མཁལ་མ་སྙིང་དང་ནང་གྲོལ་གྱིས། །སྙིམ་པ་ཤིན་ཏུ་བཀང་བ་དང་། །
en: “With sharp teeth, red hands, And lips spattered with blood, They filled their hands With half-eaten bodies, And with kidneys, hearts, and other internal organs.

source: བྱིས་པ་དག་ནི་ཟ་བཞིན་དུ། །མེར་མེར་པོ་དང་སྲོག་ཆགས་ཀྱི། །རྐང་ལག་རྣམས་ཀྱི་སྟོབས་ཀྱང་འཕྲོག །
en: “While devouring children, They robbed embryos and creatures Of the strength of their limbs.

source: ཀེང་རུས་ཀྱི་ནི་ལུས་ཀྱིས་སུ། །སྐྱེ་བོ་མང་པོ་སྐྲག་པར་བྱེད། །
en: With the bodies of skeletons, They terrorized many people.

source: ཁྲག་གིས་རབ་ཏུ་བཀང་བ་ཡི། །མི་ཡི་པགས་པ་ཐོགས་ནས་སུ། །མི་བཟད་དུག་གིས་ཀུན་བསྐུས་ཏེ། །
en: “Carrying human skins, Filled with blood, And smeared with potent poison,

source: ཕྱོགས་ཕྱོགས་དག་ཏུ་རྣམ་པར་རྒྱུག །
en: They ran all around.

source: གྲོང་ཁྱེར་རྣམས་ཀྱི་སྒོ་དག་དང་། །ཁྱིམ་ནས་ཁྱིམ་དུ་རྣམ་པར་འཐོར། །
en: “They scattered to the gates of the cities, From house to house,

source: རླུང་དང་བད་ཀན་མཁྲིས་པ་རྣམས། །ཕྱོགས་བཞི་དག་ཏུ་འཁྲུག་པར་བྱེད། །
en: And disturbed the humors of wind, bile, and phlegm Throughout the four directions.

source: དེ་ལྟར་དེ་ན་རྒྱལ་པོ་ཡི། །གདོན་དང་འཇིགས་པ་ཆེན་པོ་རྣམས། །ལྷགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་། །རིག་སྔགས་ཞགས་པས་རབ་ཏུ་བསྡམས། །
en: “All such graha kings And terrifying beings Assembled there Are bound by the noose incantation.

source: ཕྱག་འཚལ་སྐྱེས་བུ་དཔའ་ཁྱོད་ལ། །ཕྱག་འཚལ་སྐྱེས་བུ་མཆོག་ཁྱོད་ལ། །ཐལ་མོ་སྦྱར་ནས་ཕྱག་འཚལ་ལོ། །ཆོས་རྒྱལ་ཁྱོད་ལ་ཕྱག་འཚལ་ལོ། །
en: “Homage to you, heroic being! Homage to you, supreme being! We pay homage with palms joined! Homage to you, king of Dharma!

source: གྲོང་ཁྱེར་གྲོང་དང་ཡུལ་འཁོར་དང་། །ཕོ་བྲང་འཁོར་ན་རྒྱུ་བ་ནི། །གནོད་སྦྱིན་མ་རུངས་མདངས་འཕྲོག་པ། །
en: “Coursing throughout cities, towns, countries, And the courts of royal palaces, The horrible yakṣas steal luster.

source: སྙིང་རྗེ་མེད་ཅིང་ཁྲག་འཐུང་བ། །ལུས་ཆེན་འཇིགས་པ་ཆེན་པོ་སྟེ། །
en: Devoid of compassion, they drink blood.

source: སྟོབས་པོ་ཆེ་ལ་སྒྲ་ཡང་ཆེ། །མགྲིན་བཅུ་པོ་ལ་མིག་སྟོང་པོ། །གདོན་ཆེན་མིག་ནི་དམར་པོ་རྣམས། །འཁོར་ནི་མང་པོ་རྣམས་བཏང་སྟེ། །
en: “They are large bodied and terrible, Mighty and loud, With ten necks and a thousand eyes, Great grahas with red eyes. “Dispatching their retainers,

source: ལག་ན་མཚོན་ཐོགས་རབ་ཏུ་འཇིགས། །
en: They are terrifying, with weapons in their hands.

source: སྦྲུལ་གྱི་ཞགས་པ་ཐོགས་པ་དང་། །ལག་བཞི་ལག་ན་སྒྲོན་མ་ཐོགས། །ལག་ན་མཚོན་དང་དབྱིག་པ་ཐོགས། །རྡོ་རྗེ་མདུང་རྩེ་ལག་ཐོགས་པ། །
en: Some are carrying serpent nooses; “Those with four arms carry torches, Knives, sticks, And vajra spears.

source: རབ་ཏུ་དྲག་པའི་དམག་བརྒལ་ནས། །ཕྱོགས་ཀུན་ཏུ་ནི་སྐྲག་པར་བྱེད། །
en: Vanquishing fierce armies, They bring terror everywhere.

source: སྡང་བའི་གནས་ན་འཁོད་པ་ཡི། །གསང་བ་པོ་ནི་དད་ཀུན་ཀྱང་། །མི་ཡི་འཇིག་རྟེན་འདི་དག་ཏུ། །སྐྱེས་པ་བུད་མེད་གཞན་ཡང་འཛིན། །
en: “Even all the gracious guhyakas Dwelling in the locale of the wicked Seize men, women, and others In these worlds of humans.

source: ཤ་ཁྲག་དྲོན་མོར་བཅས་པ་ལ། །
en: “Reveling in warm flesh and blood,

source: རྣམ་པར་འཁྲུལ་ཅིང་འདོད་པའི་གཟུགས། །སེང་གེ་དང་ནི་སྟག་དང་རྟ། །མ་ཧེ་བ་ལང་བོང་བུ་རྔ། །གླང་པོ་ཆེ་ཡི་གཟུགས་འདྲ་དང་། །དོམ་དང་གཟིག་དང་སྤྱང་ཀི་དང་། །ཁྱི་དང་ཝ་དང་ར་དག་དང་། །བྱི་ལ་བྱི་བ་སྤྲེའུའི་གཟུགས། །བསེ་དང་ཕག་དང་སྲེ་མོང་དང་། །ཉ་དང་རུས་སྦལ་དག་གི་གཟུགས། །ཁ་ཅིག་དག་ནི་སྲམ་གྱི་གཟུགས། །ཁྭ་དང་འུག་པ་ཁུ་བྱུག་དང་། །བྱ་རྒོད་ཁྲ་དང་ཉ་མིད་བཅས། །རྨ་བྱ་ངང་པ་ཐི་བྱ་དང་། །ཁྲུང་ཁྲུང་དང་ནི་བྱ་རྣམས་དང་། །ཁ་ཅིག་བྱ་གག་གཟུགས་རྣམས་སུ། །གནོད་སྦྱིན་རྣམས་ནི་མི་ཡིས་མཐོང་། །
en: they are protean— Humans see the yakṣas In the form of lions, tigers, or horses, Buffaloes, cows, asses, camels, Or elephants, “Bears, leopards, or jackals, Dogs, foxes, or goats, “In the form of cats, rats, or monkeys, In the form of rhinoceroses, boars, mongooses, Fish, or turtles. “Some are seen in the form of otters; Others are seen in the form of crows, owls, or cuckoos, Vultures, falcons, or timitimiṅgila fish; “Still others are seen In the form of peacocks, or swans, Swans, curlews, Or wild cocks.

source: འདབ་བཟངས་བྱ་ཡི་ཚུལ་གྱིས་ཀྱང་། །སྐྱེ་བོ་མང་པོ་སྐྲག་པར་བྱེད། །
en: “Even as birds They terrorize many people.

source: ཁ་ཅིག་མི་ཡི་མགོ་ཅན་ལ། །ལུས་ནི་བྱ་གག་བོང་བུ་འདྲ། །
en: Some have the heads of humans And the bodies of wild cocks, or asses.

source: ཁ་ཅིག་མཚོན་གྱིས་རབ་ཏུ་འཚེ། །ལུས་དང་བྲལ་བ་དག་ཏུ་སྣང་། །
en: “Some attack with weapons; Others manifest as disembodied.

source: རྣམ་པར་འཁྲུགས་ཤིང་འདོད་ལ་མོས། །རྒྱུ་མའི་ཕྲེང་བས་ཀུན་ཏུ་དཀྲིས། །
en: Disturbed and driven by their wants, They are draped in intestine garlands.

source: རྩེ་གསུམ་མདུང་གིས་རབ་འདེབས་ཤིང་། །སྲོག་ཆགས་རྣམས་ལ་གནོད་པར་བྱེད། །
en: “Stabbing with tridents, They injure creatures.

source: མི་བཟད་གདུག་པའི་དབུགས་འབྱིན་ཅིང་། །སྐྱེ་དགུ་འདི་དག་སྐྲག་པར་བྱེད། །
en: Exclaiming horrid sounds, Beings are tormented.

source: སྲོག་ཆགས་རྒྱུད་ནི་ཇི་སྙེད་པར། །སྣ་ཚོགས་ཀྱི་ནི་གཟུགས་སུ་སྣང་། །
en: “They manifest in various forms, As many as there are types of creatures.

source: ཁ་ཅིག་དག་ནི་རི་ཡང་ཐོགས། །ལ་ལ་རལ་གྲི་འཁོར་ལོ་ཐོགས། །
en: Some even hold mountains, While others hold swords and disks.

source: གྲངས་ནི་བརྒྱ་ཕྲག་སྟོང་རྣམས་ཏེ། །དབྱུག་པས་བསྡིགས་ཤིང་ཁ་དྲག་པོ། །
en: “Numbering in the hundreds of thousands, Rākṣasas are threatened with clubs and abuse,

source: མིག་ཕྱུང་བ་ལ་བཞིན་མི་སྡུག །སྲིན་པོ་སོ་ནི་རྣོ་བ་དང་། །སྣ་དང་རྣ་བ་བཅད་པ་དང་། །ལྕེ་ཆད་གདོང་ནི་གཉེར་མ་ཅན། །རྐང་ལག་དང་ནི་གཏུབས་པ་དང་། །མགོ་བོ་བཅད་པའི་སྲིན་པོ་རྣམས། །
en: Their eyes are plucked out, their faces disfigured, And their teeth are broken. “Rākṣasas have their noses and ears severed, Their tongues severed, and their faces wrinkled. Their hands and feet are chopped off, And their heads are cut off.

source: སྐབས་ནི་རབ་ཏུ་ཚོལ་བར་བྱེད། །སྡིག་པ་ཅན་རྣམས་མདངས་ཀྱང་འཕྲོག །
en: “Seeking an opportunity, They steal the luster of the wicked.

source: མི་དག་གི་ནི་ལུས་རྣམས་ལ། །རབ་ཏུ་ཕྲ་བའི་གདོན་དུ་སྣང་། །
en: They manifest as microscopic grahas In the bodies of humans.
